// - Вивести числа від 20 до 30 через пропуск, використовуючи крок 0,5 (20 20,5 21 21,5….)
// let str = "";
// for (num1 = 20; num1 <= 30; num1 += 0.5) {
//   str += num1 + " ";
// }
// console.log(str);
// - Один долар коштує 27 гривень. Вивести дані з розрахунком вартості 10, 20, 30... 100 доларів
// let doll = 27;
// for (num = 10; num <= 100; num += 10) {
//   console.log(num * doll);
// }

// - Дане ціле число. Вивести всі цілі числа від 1 до 100, квадрат яких не перевищує числа N
// let num = +prompt();
// for (num1 = 1; num1 <= 100; num1 += 1) {
//   if (num >= num1 * num1) {
//     console.log(num1);
//   }
// }

// - Дане ціле число. З'ясувати, чи є воно простим (простим називається число, більше 1, які не мають інших дільників крім 1 і себе).
// let num = +prompt();
// if (
//   (num > 1 && num / num === 1 && num / 1 === num && num % 2 !== 0) ||
//   num === 2
// ) {
//   alert("простое");
// } else {
//   alert("не простое");
// }
